public/about.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Biography</title>
<meta name="description" content="Borislav Dostumski – Self-Taught Software Engineer" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Biography</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-org6574421" class="outline-2">
<h2 id="org6574421">Borislav Dostumski</h2>
<div class="outline-text-2" id="text-org6574421">
<p>
<i>Self-Taught Software Engineer — Sofia, Bulgaria</i>
</p>

<p>
<a href="https://www.16personalities.com/profiles/174cea7f4333b">INTJ-A</a> · <a href="https://www.hackerrank.com/profile/b_dostumski">HackerRank</a>
</p>

<hr>
</div>
</div>
<div id="outline-container-orgbf27a96" class="outline-2">
<h2 id="orgbf27a96">Biography</h2>
<div class="outline-text-2" id="text-orgbf27a96">
<p>
Back-end engineer by trade. Self-taught by choice.
</p>

<p>
It started in 1999 — a Pentium III, a stack of books, and more
Windows re-installs than I care to remember. The curiosity never
changed, only the tools.
</p>

<blockquote>
<p>
I use Arch, BTW.
</p>
</blockquote>

<p>
Emacs is not just my editor — it is my operating environment. From writing
code and managing projects with Org Mode, to publishing this very website —
Emacs is the lens through which I interact with my digital world. Its
infinite extensibility mirrors the self-taught philosophy: if something
doesn't exist, you build it yourself.
</p>

<p>
Vim lives in my muscle memory. Whether editing a configure files or
navigating code at speed with Evil Mode inside Emacs, Vim keybindings are
the language my fingers speak.
</p>

<p>
Arch Linux is my OS of choice because it refuses to make decisions for you.
A minimal base, a rolling release, and the legendary
<a href="https://wiki.archlinux.org/">ArchWiki</a> — Arch rewards those who want to
understand every layer of their system.
</p>

<hr>
</div>
</div>
<div id="outline-container-org0ed3638" class="outline-2">
<h2 id="org0ed3638">Technical Skills</h2>
<div class="outline-text-2" id="text-org0ed3638">
</div>
<div id="outline-container-org466a757" class="outline-3">
<h3 id="org466a757">Languages</h3>
<div class="outline-text-3" id="text-org466a757">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Language</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Java</td>
<td class="org-left">Primary — Spring, OOP, Data Structures</td>
</tr>

<tr>
<td class="org-left">SQL</td>
<td class="org-left">PostgreSQL, MySQL — queries, schema, tuning</td>
</tr>

<tr>
<td class="org-left">JavaScript / TS</td>
<td class="org-left">Node.js, Express, REST APIs, Jest</td>
</tr>

<tr>
<td class="org-left">Emacs Lisp</td>
<td class="org-left">Org Mode, site tooling, Emacs config</td>
</tr>

<tr>
<td class="org-left">PHP</td>
<td class="org-left">Web origins, custom business apps</td>
</tr>

<tr>
<td class="org-left">C / C++</td>
<td class="org-left">Self-taught foundations</td>
</tr>

<tr>
<td class="org-left">Bash / Shell</td>
<td class="org-left">Daily use on Arch Linux</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf06bce0" class="outline-3">
<h3 id="orgf06bce0">Frameworks &amp; Tools</h3>
<div class="outline-text-3" id="text-orgf06bce0">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Area</th>
<th scope="col" class="org-left">Technologies</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Back-end</td>
<td class="org-left">Spring Boot, Spring Security, Spring Cloud, Node.js</td>
</tr>

<tr>
<td class="org-left">Auth</td>
<td class="org-left">OAuth2, JWT, Role-based access control</td>
</tr>

<tr>
<td class="org-left">Databases</td>
<td class="org-left">PostgreSQL, MySQL, MongoDB, Redis</td>
</tr>

<tr>
<td class="org-left">Messaging</td>
<td class="org-left">RabbitMQ, Kafka</td>
</tr>

<tr>
<td class="org-left">DevOps</td>
<td class="org-left">Docker, Kubernetes, GitHub Actions, AWS</td>
</tr>

<tr>
<td class="org-left">Editor / OS</td>
<td class="org-left">Emacs (Evil, Magit, Org), Vim, Arch Linux</td>
</tr>

<tr>
<td class="org-left">Version Ctrl</td>
<td class="org-left">Git, Magit</td>
</tr>
</tbody>
</table>

<hr>
</div>
</div>
</div>
<div id="outline-container-orgef540a7" class="outline-2">
<h2 id="orgef540a7">Experience</h2>
<div class="outline-text-2" id="text-orgef540a7">
</div>
<div id="outline-container-org714614b" class="outline-3">
<h3 id="org714614b">Software Engineer</h3>
<div class="outline-text-3" id="text-org714614b">
<p>
<i>~2020 – Present</i>
</p>

<ul class="org-ul">
<li>Back-end services and REST APIs in <b>Java / Spring Boot</b></li>
<li>Security: <b>Spring Security</b>, OAuth2, JWT, session and token auth</li>
<li>Micro-services: Eureka, API Gateway, Feign, RabbitMQ, Kafka, Docker, Kubernetes</li>
<li>Databases: <b>PostgreSQL</b>, MongoDB — schema design, indexing, data modeling</li>
<li>Node.js APIs: JWT auth, file uploads, email, Stripe payments</li>
<li>Custom <b>Arch Linux</b> development environment with Emacs as primary IDE</li>
</ul>
</div>
</div>
<div id="outline-container-orgfcd65cd" class="outline-3">
<h3 id="orgfcd65cd">Entrepreneur — Construction Business</h3>
<div class="outline-text-3" id="text-orgfcd65cd">
<p>
<i>~2007 – ~2020 · Blagoevgrad, Bulgaria</i>
</p>

<ul class="org-ul">
<li>Co-founded and ran a construction business with my father</li>
<li>Full life cycle: production, marketing, sales, contracts, business management</li>
<li>Built a <b>WordPress site</b> that brought in significant new customers</li>
<li>Built a <b>custom PHP app</b> to track orders, customers, income, and expenses</li>
</ul>

<hr>
</div>
</div>
</div>
<div id="outline-container-orgec02a6d" class="outline-2">
<h2 id="orgec02a6d">Languages</h2>
<div class="outline-text-2" id="text-orgec02a6d">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Language</th>
<th scope="col" class="org-left">Level</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Bulgarian</td>
<td class="org-left">Native</td>
</tr>

<tr>
<td class="org-left">English</td>
<td class="org-left">Intermediate</td>
</tr>

<tr>
<td class="org-left">Elisp</td>
<td class="org-left">Conversational 😄</td>
</tr>
</tbody>
</table>

<div class="site-footer">
    <ul class="social-icons">
        <li><a href="https://github.com/bdostumski" rel="nofollow noopener noreferrer"><i class="fab fa-fw fa-github" aria-hidden="true"></i> GitHub</a></li>
        <li><a href="https://www.linkedin.com/in/borislav-dostumski/" rel="nofollow noopener noreferrer"><i class="fab fa-linux" aria-hidden="true"></i> LinkedIn</a></li>
    </ul>
</div>
</div>
</div>
</div>
</body>
</html>
